tap "dart-lang/dart"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
tap "sass/sass"
# Search tool like grep, but optimized for programmers
brew "ack"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8", link: true
# Core application library for C
brew "glib"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Improved top (interactive process viewer)
brew "htop"
# Configurable static site generator
brew "hugo"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Fast, highly customisable system info script
brew "neofetch"
# Read-write NTFS driver for FUSE
brew "ntfs-3g"
# Manage multiple Node.js versions
brew "nvm"
# Object-relational database system
brew "postgresql"
# Implementation of Telnet and SSH
brew "putty"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# A badass zsh theme with more power than a normal earthling
brew "sambadevi/powerlevel9k/powerlevel9k"
# Stylesheet Preprocessor
brew "sass/sass/sass"
cask "godot"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Finder Toolbar app to open the current directory in Terminal or Editor
cask "openinterminal"
# QuickLook plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# Display image info and preview unsupported formats in QuickLook
cask "qlimagesize"
# QuickLook generator for Markdown files
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
cask "quicklookase"
# Application for inspecting installer packages
cask "suspicious-package"
